Revit 2027 API
RebarHandlesData.SetStartHandle Method
 Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStartHandle(
	int startHandleTag
)
Public Sub SetStartHandle (
	startHandleTag As Integer
)
public:
void SetStartHandle(
	int startHandleTag
)
member SetStartHandle :
        startHandleTag : int -> unit
Parameters
startHandleTag Int32
 The tag of the start handle.
See Also
Reference
RebarHandlesData Class
Autodesk.Revit.DB.Structure Namespace